results/node/nest.txt
Bundle: 1.3 MB
Startup: 106.4 ms
Memory before: 119.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     47910.48    6168.48   53878.50
  Latency       10.44ms    42.12ms      3.16s
  HTTP codes:
    1xx - 0, 2xx - 477776, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.25MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     40825.12    5199.59   46340.58
  Latency       12.26ms    39.25ms      3.11s
  HTTP codes:
    1xx - 0, 2xx - 406326, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    11.96MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     34810.79    4090.66   39277.50
  Latency       14.37ms    35.91ms      2.05s
  HTTP codes:
    1xx - 0, 2xx - 347068, 3xx - 0, 4xx - 0, 5xx - 0
    others - 48
  Errors:
       timeout - 48
  Throughput:    13.26MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       331.62     165.83     517.61
  Latency       30.14ms     2.46ms    60.40ms
  HTTP codes:
    1xx - 0, 2xx - 3319, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.37GB/s

Memory after: 216.3 MB