results/node/ultimate-express.txt
Bundle: 582.1 KB
Startup: 101.3 ms
Memory before: 103.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    415336.96   38507.58  464037.80
  Latency        1.20ms   310.91us    63.96ms
  HTTP codes:
    1xx - 0, 2xx - 4137677, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    90.75MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    112734.27   17718.85  128617.92
  Latency        4.44ms   563.81us    56.42ms
  HTTP codes:
    1xx - 0, 2xx - 1123450, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    28.81MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    132011.35   18230.17  148354.82
  Latency        3.79ms   543.19us    55.63ms
  HTTP codes:
    1xx - 0, 2xx - 1316062, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    45.55MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       428.82     120.86    1006.47
  Latency       23.29ms     2.69ms    63.23ms
  HTTP codes:
    1xx - 0, 2xx - 4296, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.66GB/s

Memory after: 240.6 MB